DataProcessors/МЙ_ПоискКонтрагентаВВетисе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>МЙ_ПоискКонтрагентаВВетисе</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ТаблицаКонтрагентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>GUID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>name</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаПлощадок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>GUID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>name</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>addressView</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/МЙ_СоответствиеКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>МЙ_СоответствиеКонтрагентов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Uuid</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Type</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>inn</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Name</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>fullName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>fio</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>addressView</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CreateDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>UpdateDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/МЙ_ПоднадзорныеОбъектыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>МЙ_ПоднадзорныеОбъектыКонтрагентов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Uuid</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Type</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>inn</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Name</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>fullName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>fio</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>addressView</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CreateDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UpdateDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/МЙ_ПоискКонтрагентаВВетисе/Forms/ФормаУпр/Ext/Form/Module.bsl
//+++АК ERMK 2018.12.03 ИП-00020563
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Контрагент = Параметры.Контрагент;

КонецПроцедуры

&НаСервере
Процедура ПоискНаСервере()
	ФабрикаXD = ОбменССистемойВетис.ПолучитьФабрикуXDTOEnterpiseService();
	
	ListOptions = ФабрикаXD.Создать("http://api.vetrf.ru/schema/cdm/base", "ListOptions");  
	ListOptions.count = 100;  
	
	BusinessEntity = ФабрикаXD.Создать("http://api.vetrf.ru/schema/cdm/cerberus/enterprise", "BusinessEntity"); 
	BusinessEntity.inn = Контрагент.ИНН;
	
	ПроксиEnterprise = ОбменССистемойВетис.ПолучитьПроксиEnterprise(ОбменССистемойВетис.ОсновнаяНастройкаАПИ());	
	
	Объект.ТаблицаКонтрагентов.Очистить();
	Попытка 
		Ответ = ПроксиEnterprise.GetBusinessEntityList(ListOptions, BusinessEntity);
		Если ТипЗнч(Ответ) = Тип("ОбъектXDTO") Тогда
			businessEntity =  ОбменССистемойВетис.ПолучитьСвойствоОбъектаXDTO(Ответ, "businessEntity");
			
			а = 0;
			Если ТипЗнч(businessEntity) = Тип("СписокXDTO") Тогда
				Для каждого Стр Из businessEntity Цикл
					НСтр = Объект.ТаблицаКонтрагентов.Добавить();
					ЗаполнитьЗначенияСвойств(Нстр, Стр);

					Если а = 0 Тогда
						ЗаполнитьТаблицуПлощадокНаСервере(НСтр.GUID);
						НСтр.Пометка = Истина;
					КонецЕсли;
					
					а = а + 1;
				КонецЦикла;					
			КонецЕсли;	
		КонецЕсли;	
	Исключение		
		
	КонецПопытки;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуПлощадокНаСервере(GUID)
	ПроксиEnterprise = ОбменССистемойВетис.ПолучитьПроксиEnterprise(ОбменССистемойВетис.ОсновнаяНастройкаАПИ());
	
	Попытка
		Ответ = ПроксиEnterprise.GetBusinessEntityByGuid(GUID);
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	ТЗГуидПлощадок = Новый ТаблицаЗначений; 	
	ТЗГуидПлощадок.Колонки.Добавить("ГУИД", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(36)));
	
	Если ТипЗнч(Ответ) = Тип("ОбъектXDTO") Тогда
		СписокПлощадок = ОбменССистемойВетис.ПолучитьСвойствоОбъектаXDTO(Ответ, "activityLocation"); 	
		
		Если ТипЗнч(СписокПлощадок) = Тип("СписокXDTO") Тогда
			
			Для каждого ЗначСписка Из СписокПлощадок Цикл
				Нстр = ТЗГуидПлощадок.Добавить();
				Нстр.ГУИД = ЗначСписка.enterprise.guid;
			КонецЦикла;
			
		КонецЕсли;		
	КонецЕсли;
	
	Объект.ТаблицаПлощадок.Очистить();
	
	а = 0;
	Для каждого Стр Из ТЗГуидПлощадок Цикл
		GUIDПлощадки = Стр.ГУИД;
		Попытка
			Ответ = ПроксиEnterprise.GetEnterpriseByGuid(GUIDПлощадки);
		Исключение
			Сообщить(ОписаниеОшибки());
			Возврат;
		КонецПопытки;
		
		Если ТипЗнч(Ответ) = Тип("ОбъектXDTO") Тогда			 
			НСтр = Объект.ТаблицаПлощадок.Добавить();
			ЗаполнитьЗначенияСвойств(НСтр, Ответ);			 
			НСтр.addressView = Ответ.address.addressView;
		КонецЕсли; 
		
		а = а + 1;
		// Состояние("Обработан " + Строка(а));
	КонецЦикла;	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Поиск(Команда)
	ПоискНаСервере();
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	Для каждого Стр Из Объект.ТаблицаКонтрагентов Цикл
		Если Стр.Пометка = Истина Тогда
			Запись = РегистрыСведений.МЙ_СоответствиеКонтрагентов.СоздатьМенеджерЗаписи();
			Запись.Контрагент = Контрагент;
			Запись.Прочитать();
			
			Запись.Контрагент = Контрагент;
			Запись.GUID = Стр.GUID;
			Запись.Записать();		
		КонецЕсли;	
	КонецЦикла;	
	
	Для каждого Стр Из Объект.ТаблицаПлощадок Цикл
		Спр = Справочники.МЙ_ПоднадзорныеОбъектыКонтрагентов.НайтиПоРеквизиту("GUID", Стр.GUID,, Контрагент);
		
		Если Спр.Пустая() Тогда
			Спр = Справочники.МЙ_ПоднадзорныеОбъектыКонтрагентов.СоздатьЭлемент();
			Спр.Владелец = Контрагент;
			Спр.addressView = Стр.addressView;
			Спр.GUID = Стр.GUID;
			Спр.Name = Стр.name;
			
			//+++АК LATV 2018.07.15 ИП-00019272
			Спр.Наименование = СокрЛП(Стр.name) + СокрЛП(Стр.addressView);
			//+++АК LATV Конец
			
			Спр.Записать();
		КонецЕсли;	
		
		Если Стр.Пометка = Истина Тогда
			СпрКонтр = Контрагент.ПолучитьОбъект();
			СпрКонтр.МЙ_ОсновнаяПлощадка = Спр.Ссылка;
			СпрКонтр.ОбменДанными.Загрузка = Истина;
			СпрКонтр.Записать();
		КонецЕсли;	
			
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКонтрагентовПриАктивизацииСтроки(Элемент)
	ТС = Элемент.ТекущиеДанные;
	Если ТС = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	GUID = ТС.GUID;
	
	ЗаполнитьТаблицуПлощадокНаСервере(GUID);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПлощадокПометкаПриИзменении(Элемент)
	ТС = Элемент.Родитель.ТекущиеДанные;
	
	Если ТС.Пометка = Истина Тогда		 
		Для каждого Стр Из Объект.ТаблицаПлощадок Цикл
			Если Стр.НомерСтроки = ТС.НомерСтроки Тогда
				Продолжить;				 
			КонецЕсли; 
			
			Стр.Пометка = Ложь;
		КонецЦикла; 	 
	КонецЕсли;
	
КонецПроцедуры
